Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P18.tmx
Source language: en_us
Languages: zh_cn

source: La Vita Nuova
zh_cn: 新生

source: The day her fiance left, Amanda went walking in the Colonial cemetery off Garden Street.
zh_cn: 阿曼达的未婚夫离去那天，她离开花园街去了殖民地公墓散步。

source: The gravestones were so worn that she could hardly read them.
zh_cn: 墓碑十分破旧，她几乎无法读出它们。

source: They were melting away into the weedy grass.
zh_cn: 它们正逐渐消失在杂草丛中。

source: You are a very dark person, her fiance had said.
zh_cn: 你是一个非常忧郁的人，她的未婚夫曾说过。

source: She walked home and sat in her half-empty closet.
zh_cn: 她走回家，坐在她那半空的衣橱里。

source: Her vintage nineteen-fifties wedding dress hung in clear asphyxiating plastic printed "NOT A TOY."
zh_cn: 她的老式的1950年代的婚纱礼服挂在明亮的令人窒息的塑料袋里，上面印着“ 不是玩具。”

source: She took the dress to work.
zh_cn: 她把婚纱礼服带去工作的地方。

source: She hooked the hanger onto a grab bar on the T and the dress rustled and swayed.
zh_cn: 她把衣架挂在地铁车厢里的扶手杆上，衣服沙沙地响着，摇摆着。

source: When she got out at Harvard Square, the guy who played guitar near the turnstiles called, "Congratulations."
zh_cn: 当她在哈佛广场站走出来的时候，那个在旋转闸口附近的弹吉他的人喊道，“恭喜你。"

source: Work was at the Garden School, where Amanda taught art, including theatre, puppets, storytelling, drumming, dance, and now fabric painting.
zh_cn: 工作的地方是在花园学校，在那里阿曼达教艺术，包括戏剧，木偶，讲故事，击鼓，舞蹈，现在是织布绘画。

source: She spread the white satin gown on the art-room floor.
zh_cn: 她把那件白色缎子礼服摊开放在艺术课教室的地板上。

source: Two girls glued pink feathers all along the hem.
zh_cn: 两个女孩沿着下摆贴满了粉红色的羽毛。

source: Others brushed the skirt with green and purple.
zh_cn: 其他人则在裙子上刷上绿色和紫色。

source: A boy named Nathaniel dipped his hand in red paint and left his little handprint on the bodice as though the dress were an Indian pony.
zh_cn: 一个名叫纳撒尼尔的男孩把他的手浸在红色油漆里，然后把他的小手印印在胸衣上，仿佛这件衣服是一匹印第安小马。

source: At lunchtime, the principal asked Amanda to step into her office.
zh_cn: 午饭时间，校长叫阿曼达去她的办公室。

source: You are like living with a dark cloud, Amanda's fiance had told her when he left.
zh_cn: 你就像是和乌云生活在一起，阿曼达的未婚夫离开她时对她说过。

source: You're always sad.
zh_cn: 你总是一幅忧伤的样子。

source: I'm sad now, Amanda had said.
zh_cn: 我现在就很忧伤，阿曼达曾说过。

source: The principal told Amanda that, for an educator, boundaries were an issue.
zh_cn: 校长告诉阿曼达，身为一个教育工作者，要注意做事的场合。

source: "Your personal life,"said the principal, "is not an appropriate art project for first grade.
zh_cn: “你的个人生活，”校长说，“不是一个适合一年级的艺术项目。

source: Your classroom,"said the principal, "is not an appropriate forum for your relationships.
zh_cn: 你的教室，”校长说，“不是为你的个人关系开的一个适当的论坛。

source: Let's pack up the wedding dress."
zh_cn: 把那件结婚礼服包起来吧。”

source: "It's still wet,"Amanda said.
zh_cn: “它还是湿的呢，”阿曼达说。

source: Her mother could not believe it.
zh_cn: 她的妈妈简直不敢相信这件事。

source: She had just sent out all the invitations.
zh_cn: 她刚刚寄出了所有的邀请。

source: Her father swore he'd kill the son of a bitch.
zh_cn: 她的爸爸发誓他要杀了这个婊子养的。

source: They both asked how this could have happened, but they remembered that they had had doubts all along.
zh_cn: 他们都问怎么会成这样，但他们记得，他们一直都存有疑虑。

source: Her sister Lissa said she could not imagine what Amanda was going through.
zh_cn: 她的姐姐利萨说，她无法想象阿曼达正在经历着什么。

source: She must feel so terrible.
zh_cn: 她肯定感觉很糟糕。

source: Was Amanda going to have to write to everyone on the guest list?
zh_cn: 阿曼达是否不得不给客人名单上所有的人写个通知？

source: Like a card or something?
zh_cn: 比如一个卡片或别的什么东西？

source: She'd have to tell everybody, wouldn't she?
zh_cn: 她不得不告诉每一个人，是不是？

source: I waited all this time because I didn't want to hurt you, Amanda's fiance had said.
zh_cn: 这段时间我一直在等，因为我不想伤害你，阿曼达的未婚夫说过。

source: After school, she went for a drink with the old blond gym teacher, Patsy.
zh_cn: 放学后，她和年老的金发的体育教师帕齐去喝饮料。

source: They went to a bar called Cambridge Common and ordered gin-and-tonics.
zh_cn: 他们去了一家叫剑桥公地的酒吧，并点了杜松子酒和汤力水。

source: Patsy said, "Eventually, you're going to realize that this is a blessing in disguise."
zh_cn: 帕齐说，“最终，你会认识到这是一个变相的祝福。”

source: "We had too many differences,"said Amanda.
zh_cn: “我们有太多的不同，”阿曼达说。

source: Patsy lifted her glass.
zh_cn: 帕齐举起杯子。

source: "There you go."
zh_cn: “说说看。”

source: "For example, I loved him and he didn't love me."
zh_cn: “例如，我爱他，而他不爱我。”

source: "Don't be surprised,"said Patsy, "if he immediately marries someone else.
zh_cn: “你可不要惊讶，”帕齐说，“如果他立即和别人结了婚。

source: Guys like that immediately marry someone else."
zh_cn: 像这样的家伙立即和别人结了婚。”

source: "Why?"Amanda asked.
zh_cn: “为什么？”阿曼达问。

source: Patsy sighed.
zh_cn: 帕齐叹了口气。

source: "If I knew that, I'd be teaching at Harvard, not teaching the professors' kids."
zh_cn: “如果我知道为什么，我就应该在哈佛大学教书，而不是教教授的孩子。”

source: Amanda tried writing a card or something.
zh_cn: 阿曼达在尝试写一个卡片或别的什么。

source: She wrote that she and her fiance had decided not to marry.
zh_cn: 她写道，她和她的未婚夫已经决定不结婚了。

source: Then she wrote that her fiance had decided not to marry her.
zh_cn: 然后她写道，她的未婚夫已经决定不和她结婚了。

source: She said that she was sorry for any inconvenience.
zh_cn: 她说，她为带来的任何不便深表歉意。

source: She added that she would appreciate gifts anyway.
zh_cn: 她又补充说，不管怎样，她很感激收到礼物。

source: Her parents told her not to send the card.
zh_cn: 她的父母告诉她不要寄出卡片。

source: They said that they were coming up for a week.
zh_cn: 他们说，他们会过来一个星期。

source: She said that they couldn't come, because she was painting her apartment.
zh_cn: 她说他们不能来，因为她在给她的公寓喷漆。

source: She did not paint the apartment.
zh_cn: 她并没有给她的公寓喷漆。

source: In the winter, Amanda cut her hair short like a boy's.
zh_cn: 在冬季，阿曼达把头发剪的像一个男孩那么短。

source: "Oh, your hair,"said Patsy.
zh_cn: “哦，你的头发，”帕齐说。

source: "Your beautiful curls."
zh_cn: “你的漂亮的卷发。”

source: In the spring, the principal told Amanda that, regretfully, she was not being renewed for the following year, because the art program at the Garden School was moving in a different direction.
zh_cn: 在春季，校长告诉阿曼达说，很遗憾，她没有被续签到下一年，因为花园学校的艺术项目在朝一个不同的方向发展。

source: In the summer, Amanda's fiance married someone else.
zh_cn: 在夏季，阿曼达的未婚夫和别人结婚了。

source: When school ended, Amanda took a job babysitting Nathaniel, the boy with the red handprint.
zh_cn: 当学校工作结束后，阿曼达接了一个照顾纳撒尼尔的保姆工作，就是那个红手印的男孩。

source: Nathaniel's mother asked for stimulating activities, projects, science.
zh_cn: 纳撒尼尔的妈妈要求安排一些有趣的活动，项目，科学。

source: No TV.
zh_cn: 不可以看电视。

source: Nathaniel's father didn't ask for anything.
zh_cn: 纳撒尼尔的爸爸没有要求任何事情。

source: Their first day together, Amanda asked Nathaniel, "What do you want to do?"
zh_cn: 他们第一天在一起的时候，阿曼达问纳撒尼尔，“你想做什么？”

source: "Nothing."
zh_cn: “没什么想做的。”

source: She said, "You read my mind."
zh_cn: 她说：“你读懂了我的心。”

source: They ate chocolate mice at Burdick's and then they stood in front of the Harvard Coop and listened to Peruvian musicians.
zh_cn: 他们在伯迪克店吃老鼠巧克力，然后他们站在哈佛合作社书店前，听秘鲁音乐家的音乐。

source: They explored the cemetery, and Amanda told Nathaniel that the gravestones were dragons' teeth.
zh_cn: 他们探讨了墓地，阿曼达告诉纳撒尼尔墓碑是龙的牙齿。

source: They walked down to the river and she said, "If you trace the river all the way to the beginning, you'll find a magic cave."They took the T to Boston and stood in line for the swan boats in the Public Garden.
zh_cn: 他们往下走到河边，她说：“如果你一路追溯这条河到源头，你会发现一个神奇的洞穴。”他们乘坐地铁去了波士顿，在大众花园里排队坐天鹅船。

source: She said, "At night, these boats turn into real swans."
zh_cn: 她说：“到了晚上，这些船会变成真正的天鹅。”

source: Nathaniel said, "You have a great imagination."
zh_cn: 纳撒尼尔说：“你有了不起的想象力。”

source: His mother lived in a Victorian house on Buckingham Street.
zh_cn: 他的妈妈住在白金汉街上的一栋维多利亚式住宅里。

source: She worked at the Media Lab at M.I.T. and she had deadlines.
zh_cn: 她在麻省理工学院的媒体实验室工作，有工作期限。

source: The house had a garden full of flowers, but Nathaniel didn't play there, because you couldn't really dig.
zh_cn: 这所住宅有一个开满了花的花园，但纳撒尼尔并不在那里玩，因为你不能真地去挖地。

source: His father lived in an upside-down town house on Chauncy Street.
zh_cn: 他的爸爸住在昌街上一座上下颠倒的独栋住宅里。

source: The bedrooms were on the bottom floors, and the kitchen and living room on top.
zh_cn: 卧室在底层，厨房和客厅在顶层。

source: His father was writing a book and he came home late.
zh_cn: 他的爸爸正在写一本书，很晚才回家。

source: Amanda and Nathaniel had pizza delivered to Chauncy Street and watched Charlie Chaplin movies from Hollywood Express.
zh_cn: 阿曼达和纳撒尼尔订了比萨送到昌街，看着来自好莱坞快递的查理卓别林的影片。

source: Sometimes they spread a sheet over the couch and ate a big bowl of popcorn.
zh_cn: 有时候，他们在沙发铺一张床单，然后吃一大碗爆米花。

source: It's hard to be with you, her fiance had said.
zh_cn: 和你相处很困难，她的未婚夫说过。

source: I feel like I'm suffocating.
zh_cn: 我感觉好像就要窒息了。

source: Open a window, Amanda had said.
zh_cn: 打开一扇窗户吧，阿曼达说过。

source: When the movie was done, Amanda gathered the sheet and stepped onto the balcony, where she shook out the crumbs.
zh_cn: 影片结束以后，阿曼达收起床单，走到阳台上，把碎屑抖掉。

source: Amanda and Nathaniel had playdates with his friends at Walden Pond.
zh_cn: 阿曼达和纳撒尼尔曾和他的朋友们在瓦尔登湖一起玩过。

source: They went canoeing on the Charles, and Nathaniel dropped his paddle in the water.
zh_cn: 他们一起去查尔斯湖划独木舟，纳撒尼尔把船桨掉到了水里。

source: Amanda almost tipped the boat, trying to fish it out.
zh_cn: 阿曼达试图把船桨打捞出来，差点弄翻了船。

source: They wrote a book about pirates.
zh_cn: 他们写了一本关于海盗的书。

source: Nathaniel told the stories and Amanda typed them on the computer in his father's study.
zh_cn: 在他爸爸的书房里，由纳撒尼尔来讲故事，阿曼达则把故事键入电脑。

source: "Aarrr, matey,"she typed, "I'm stuck on a ship."
zh_cn: “哎，朋友，”她打着，“我被困在一条船上了。”

source: When his father stayed out past Nathaniel's bedtime, Amanda tucked Nathaniel in, and then she read books in the study.
zh_cn: 当他的爸爸在外面呆过了纳撒尼尔的睡觉时间的时候，阿曼达会给纳撒尼尔盖好，然后她就在书房阅读书籍。

source: The books were about American history.
zh_cn: 那些书是关于美国历史的。

source: She read only a few pages of each, so she didn't learn anything.
zh_cn: 每本书她都只读了几页，所以她并没有学到任何东西。

source: If you ever stopped to listen, her fiance had said, then you would understand.
zh_cn: 如果你曾停下来去聆听，她的未婚夫说过，那么你就会明白。

source: She stood on a chair and pulled out some small paperbacks from the top shelf.
zh_cn: 她站在椅子上，从书架顶层抽出一些小开本的平装书。

source: Dante, "The Divine Comedy,"in a new translation.
zh_cn: 但丁，“神曲”，一个新的译本。

source: Boccaccio, "The Decameron,"Chaucer's "Canterbury Tales,"complete and unabridged.
zh_cn: 薄伽丘，“十日谈”，乔叟的“坎特伯雷故事集”，足本未删节版。

source: Dante again, "La Vita Nuova."
zh_cn: 还是但丁，“新生。”

source: "La Vita Nuova"explained how to become a great poet.
zh_cn: “新生”讲解了如何成为一名伟大的诗人。

source: The secret was to fall in love with a perfect girl but never speak to her.
zh_cn: 秘诀就是去爱上一个完美的女孩，但绝不和她说话。

source: You should weep instead.
zh_cn: 你反而应该哭泣。

source: You should pretend that you love someone else.
zh_cn: 你应该假装你爱另外一个人。

source: You should write sonnets in three parts.
zh_cn: 你应该写一些十四行诗，分成三个部分。

source: Your perfect girl should die.
zh_cn: 您的完美女孩应该死去。

source: Amanda's mother said, "You have your whole life ahead of you."
zh_cn: 阿曼达的妈妈说：“你的整个人生都提前了。”

source: She fell asleep on the couch waiting for Nathaniel's father to come home.
zh_cn: 她倒在沙发上睡着了，等着纳撒尼尔的爸爸回家。

source: When she woke up, she saw him kneeling in front of her.
zh_cn: 当她醒来时，她看见他跪在她面前。

source: She said, "What's wrong?"
zh_cn: 她说：“你怎么了？”

source: He said, "Nothing's wrong.
zh_cn: 他说，“没什么。

source: I'm sorry.
zh_cn: 对不起。

source: I didn't want to wake you."
zh_cn: 我没想弄醒你。”

source: But he did wake her.
zh_cn: 但他的确弄醒了她。

source: She went home and stayed awake all night.
zh_cn: 她回到家里，彻夜未眠。

source: "Let's go somewhere,"she told Nathaniel the next day.
zh_cn: “我们去个地方，”第二天她对纳撒尼尔说。

source: "Where?"
zh_cn: “哪里？”

source: "Far away."
zh_cn: “很远。”

source: They took the T to Ashmont, at the end of the Red Line.
zh_cn: 他们乘坐地铁去阿什莫特站，红线的终点站。

source: They sat together in the rattling car and talked about doughnuts.
zh_cn: 在卡塔卡塔响的车上他们坐在一起，谈论着面包圈。

source: "I like cinnamon doughnuts, but they make me cough,"Nathaniel said.
zh_cn: “我喜欢肉桂面包圈，但是它们会让我咳嗽，”纳撒尼尔说。

source: She slept lightly.
zh_cn: 她轻轻地睡着了。

source: She dreamed she was walking with Nathaniel in a pine forest.
zh_cn: 她梦见她和纳撒尼尔走在一片松树林里。

source: She was telling him not to step on the dead hummingbirds.
zh_cn: 她在告诉他不要踩到死的蜂鸟。

source: The birds were sapphire-throated, brilliant blue.
zh_cn: 这种鸟是天蓝色脖子的，灿烂的蓝色。

source: She stole "La Vita Nuova."
zh_cn: 她偷了“新生。”

source: It was just a paperback.
zh_cn: 只不过是一本平装书。

source: Her sister called to check in.
zh_cn: 她的姐姐打了电话去登记。

source: Her friend Jamie said she knew someone she'd like Amanda to meet.
zh_cn: 她的朋友杰米说她认识一个人，她希望阿曼达去见见。

source: Amanda said, "Soon."
zh_cn: 阿曼达说：“快了。”

source: Jamie said, "What exactly are you waiting for?"
zh_cn: 杰米说：“你到底在等什么呢？”

source: Nathaniel's father pretended not to look at her.
zh_cn: 纳撒尼尔的爸爸假装没有看她。

source: Amanda pretended not to notice his dark eyes.
zh_cn: 阿曼达假装没有留意到他邪恶的眼睛。

source: "The question is what you're going to do in September,"Amanda's mother told her on the phone.
zh_cn: “问题是在9月你会去做什么，”阿曼达的妈妈在电话里告诉她。

source: "The question is what you're going to do with your life,"her father said.
zh_cn: “问题是你的生活要怎么过，”她爸爸说。

source: Dante wrote, "O you who on the road of Love pass by, / Attend and see / If any grief there be as heavy as mine."
zh_cn: 但丁写道，“哦，你们行进在爱情的旅途，请驻足少待，看看清楚，谁的痛苦竟像我的那样严重。”

source: "When was the last time you painted anything?"her mother asked.
zh_cn: “你最后一次做画是什么时候？”她的妈妈问。

source: "Apart from your apartment?"
zh_cn: “搬离你的公寓了？”

source: Her father said, "I paid for Yale."
zh_cn: 她的爸爸说，“我为你的耶鲁学业付了学费。”

source: All day, Amanda and Nathaniel studied the red ants of Buckingham Street.
zh_cn: 一整天，阿曼达和纳撒尼尔都在研究白金汉街的红蚂蚁。

source: They experimented with cake crumbs and observed the ants change course to eat them.
zh_cn: 他们用蛋糕屑做试验，观察到蚂蚁们改变了行走路线去吃它们。

source: Nathaniel considered becoming an entomologist when he grew up.
zh_cn: 纳撒尼尔考虑着长大当一名昆虫学家。

source: The next day, he decided to open his own ice-cream store.
zh_cn: 第二天，他决定开他自己的冰淇淋店。

source: They biked to Christina's, in Inman Square.
zh_cn: 他们骑车去了位于因曼广场的克里斯蒂娜店。

source: Nathaniel pedalled in front on his little bike.
zh_cn: 纳撒尼尔在前面骑着他的小自行车。

source: Amanda pedalled behind on her big bike and watched for cars.
zh_cn: 阿曼达在后面骑着她的大自行车，同时警惕着汽车。

source: At Christina's, Nathaniel could read almost all the flavors on the board: adzuki bean, black raspberry, burnt sugar, chocolate banana, chocolate orange, cardamom.
zh_cn: 在克里斯蒂娜店，纳撒尼尔可以找到板上写着的几乎所有的口味：红豆，黑树莓，焦糖，巧克力，香蕉，巧克力橙，小豆蔻。

source: Nathaniel said, "I'll have vanilla."They sat in front near the bulletin board with ads for guitar lessons, tutoring, transcendental meditation.
zh_cn: 纳撒尼尔说：“我要香草的。”他们坐在附近的公告栏前，上面有一些广告，吉他课的，家教的，还有超觉冥想课的。

source: "What's an egg donor?"Nathaniel said.
zh_cn: “什么是卵子捐赠者？”纳撒尼尔说。

source: I want to be with you for the rest of my life, her fiance had told her once.
zh_cn: 我想和你在一起度过我的余生，她的未婚夫曾对她说过她一次。

source: You are my best friend, he had written on her birthday card.
zh_cn: 你是我最好的朋友，他曾在给她的生日卡上写着。

source: You make me smile, you make me laugh.
zh_cn: 你让我微笑，你让我大笑。

source: "Love weeps,"Dante wrote.
zh_cn: “爱神哭泣了，”但丁写道。

source: "Could I have a quarter for a gumball?"Nathaniel asked Amanda.
zh_cn: “我能拿二十五美分买一个口香糖吗？”纳撒尼尔问阿曼达。

source: "You just had ice cream,"she said.
zh_cn: “你刚刚吃完冰淇淋，”她说。

source: "Please."
zh_cn: “求你了！”

source: "No!
zh_cn: “不行！

source: You just had ice cream.
zh_cn: 你刚刚吃完冰淇淋。

source: You don't need candy."
zh_cn: 你不可以吃糖。”

source: "Please, please, please,"he said.
zh_cn: “求你了，求你了，求你了，”他说。

source: "You're lovely,"Nathaniel's father whispered to Amanda late that night.
zh_cn: “你真可爱，”那天深夜纳撒尼尔的爸爸低声对阿曼达说。

source: She was just leaving, and he'd opened the door for her.
zh_cn: 当时她正准备离开，他为她打开了门。

source: "You're not supposed to say that,"Amanda whispered back.
zh_cn: “你不应该这样说，”阿曼达小声回答。

source: "You're supposed to write a sonnet."
zh_cn: “你应该去写一首十四行诗。”

source: Nathaniel said that he knew what to do when you were upset.
zh_cn: 纳撒尼尔说他知道当你难过的时候该去做什么。

source: She said, "Tell me, Nathaniel."
zh_cn: 她说，“告诉我，纳撒尼尔。”

source: He said, "Go to the zoo."
zh_cn: 他说，“去动物园。”

source: Nathaniel studied the train schedule.
zh_cn: 纳撒尼尔研究了列车时刻表。

source: They took the Orange Line to Ruggles Station and then the No. 22 bus to the Franklin Park Zoo.
zh_cn: 他们乘坐橘色线去拉格尔斯站，然后乘22路巴士到富兰克林动物园。

source: They watched orangutans sitting on their haunches, shredding newspapers, one page at a time.
zh_cn: 他们观看猩猩臀部着地坐着，撕扯着报纸，每次撕一张。

source: They climbed up on viewing platforms to observe the giraffes.
zh_cn: 他们爬上观景平台观察长颈鹿。

source: They ran down every path.
zh_cn: 他们跑完了每一条路。

source: They looked at snakes.
zh_cn: 他们看了蛇。

source: They went to the little barnyard and a goat frightened Nathaniel.
zh_cn: 他们去了一个小谷仓，一只山羊吓到了纳撒尼尔。

source: Amanda said the goat was just curious.
zh_cn: 阿曼达说山羊只是好奇而已。

source: She said, "Goats wouldn't eat you."
zh_cn: 她说：“山羊不会吃你的。”

source: Nathaniel fell asleep on the T on the way home.
zh_cn: 回家的路上纳撒尼尔在地铁里睡着了。

source: He leaned against Amanda and closed his eyes.
zh_cn: 他靠在阿曼达身上合上了眼睛。

source: The woman sitting next to Amanda said, "He's beautiful."
zh_cn: 坐在阿曼达旁边的女人说：“他真漂亮。”

source: Amanda's friend Jamie had a party in Somerville.
zh_cn: 阿曼达的朋友杰米在萨默维尔举行一个派对。

source: The wine was terrible.
zh_cn: 那种酒太烈了。

source: The friend that Jamie wanted Amanda to meet was drunk.
zh_cn: 杰米希望阿曼达认识的那个朋友喝醉了。

source: Amanda got drunk, too, but it didn't help.
zh_cn: 阿曼达也喝醉了，但是没有帮助。

source: She was late to work the next day.
zh_cn: 第二天她晚到了。

source: She found Nathaniel waiting on his mother's porch.
zh_cn: 她发现纳撒尼尔在他妈妈的门廊等着。

source: "I thought you were sick,"he said.
zh_cn: “我以为你生病了，”他说。

source: "I was,"she told him.
zh_cn: “我是生病了，”她对他说。

source: They walked to Harvard Square and watched the street magicians.
zh_cn: 他们走到哈佛广场观看了街头魔术师表演。

source: They went to Le's and shared vegetarian summer rolls and Thai iced tea.
zh_cn: 他们去了‘乐’餐馆一起分享素食夏季卷和泰国冰茶。

source: "This tastes like orange chalk,"Nathaniel said.
zh_cn: “这个尝起来就像橙色粉笔，”纳撒尼尔说。

source: They went to a store called Little Russia and looked at the lacquered dolls there.
zh_cn: 他们去了一家叫小俄罗斯的商店，并在那里观看漆面玩偶。

source: "See, they come apart,"Amanda told Nathaniel.
zh_cn: “瞧，他们分开来了，”阿曼达告诉纳撒尼尔。

source: "You pop open this lady, and inside there's another, and another, and another."
zh_cn: “你弹开这个夫人，里面还有另一个，然后还有另一个，然后还有另一个。”

source: "Do not touch, please,"the saleslady told them.
zh_cn: “请不要触摸，”女售货员对他们说。

source: They walked down to the river and sat on the grass under a tree and talked about their favorite dogs.
zh_cn: 他们往下走到河边，坐在一棵大树下的草地上，谈论他们最喜欢的狗。

source: "Labradoodle,"Amanda said.
zh_cn: “拉布拉多德利犬，”阿曼达说。

source: Nathaniel giggled.
zh_cn: 纳撒尼尔咯咯地笑起来。

source: "No, Schnoodle."
zh_cn: “不，史努多犬。”

source: "Golden Streudel."
zh_cn: “金毛史莱德犬。”

source: Nathaniel said, "Is that the kind you had when you were young?"
zh_cn: 纳撒尼尔说：“就是你年轻的时候养的那种？”

source: She dreamed that she was a Russian doll.
zh_cn: 她梦见她是一个俄罗斯玩偶。

source: Inside her was a smaller version of herself, and inside that an even smaller version.
zh_cn: 在里面是一个小版的自己，然后在里面是一个更加小版的自己。

source: She ordered a set of blank wooden dolls online and began painting them.
zh_cn: 她在网上订购了一套空白的木制玩偶，开始给它们涂色。
